{
	"posts": [{
		"_p_originalUrl": "http://www.halfbakedharvest.com/poblano-mushroom-tacos-with-cilantro-yogurt-sauce/",
		"p_id": 10001,
		"p_title": "Poblano Mushroom Tacos with Cilantro Yogurt Sauce",
		"p_timestamp": "09/01/2017",
		"p_imageurl": "resources/blogposts/images/bp1.jpg",
		"p_content": "The family has voted and everyone LOVES these tacos. Well, everyone except the select mushrooms haters, but you know, whatever. These are so good that I made them three times in the last two weeks. Once to test the recipe, then another time to photograph, and then again last Monday after snowboarding. Everyone was starving and we decided mushroom tacos had to be made. I made chicken and lamb tacos as well, since there are a handful of people who do not like mushrooms, and because my parent’s house was packed with people at that time and we needed tons of food.\\nEven with the chicken and lamb tacos on the table, the mushroom tacos were the favorite by far. These are honestly the best, so healthy AND ready in just about thirty minutes… Which brings me to my next topic.\\nI’m thinking of starting a new series on the blog for 2017. What do you guys think of Mondays being 30-Minute Meals Monday? Meaning all the recipes I share on Mondays will all be able to be made in 30 minutes or less. Thoughts? Comments? Concerns? I’m kind of thinking it’s a good idea, but slightly worried I might not be able to hold it up all year. Hmmm, I do kind of like a challenge though…and I know you guys love quick and healthy weeknight dinners…sounding more and more like it could be a good match. Let me know what you think!",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "http://www.halfbakedharvest.com/crockpot-thai-broccoli-rabe-chicken-curry/",
		"p_id": 10002,
		"p_title": "Crockpot Thai Broccoli Rabe Chicken Curry",
		"p_timestamp": "08/01/2017",
		"p_imageurl": "resources/blogposts/images/bp2.jpg",
		"p_content": "This Crockpot Thai Broccoli Rabe Chicken Curry gives off a super cozy feel, and is the perfect, quick, easy, and healthy meal. For me, Sunday dinners should be filling, comforting and cozy…especially during these bitter cold January days. As I mentioned earlier this week, I’m really trying to have a much healthier work to life balance. Not going to lie, it’s a tricky thing to do, but these crockpot recipes are perfect because you can simply add everything into your crockpot in the morning, and come home at night to a house that smells incredible…and more importantly, a delicious meal just waiting to be shared!\\nEqually great on both busy working weekdays or jam-packed weekends. I love making this dish after a day of fun winter activities like snowboarding, snowmobiling or simply just playing all day in the snow. When I come home exhausted and starving, it’s always nice to know I already have dinner taken care of.\\nThai Broccoli Rabe Chicken Curry is quickly becoming one of my favorite crockpot recipes. I have made it at least three times in the last month alone. Granted, I’ve had a ton of people to feed, but it’s been a true life saver recipe. Everyone seems to really enjoy it and it’s beyond easy.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "http://www.halfbakedharvest.com/egg-in-a-hole-avocado-bacon-egg-and-cheese-bagel/",
		"p_id": 10003,
		"p_title": "Egg in a Hole Avocado, Bacon, Egg and Cheese Bagel",
		"p_timestamp": "21/12/2016",
		"p_imageurl": "resources/blogposts/images/bp3.jpg",
		"p_content": "I’m sure you guys have noticed, but typically when it comes to breakfast foods I’m all about the sweet recipes. I save the eggs for dinner, but I dunno I’m feeling the savory breakfast today. I think it’s probably because my brothers are here and they love eggs…and bacon…and cheese…hence the Egg in a Hole Avocado, Bacon, Egg and Cheese Bagel. Back when I was in high school, I would make my brothers bacon, egg, and cheese sandwiches almost everyday. They loved eating them after they would get home from snowboarding. I’d always go heavy on the bacon and cheese since that’s their favorite part.\\nIt had been a while since I’ve made them a good breakfast bagel, so I decided I’d make one while everyone is home for Christmas. I got a little fancier though and did an egg in a hole style bacon, egg, and cheese. I thought they might be opposed, but they basically just mowed every last bite, and then said it was the best, bagel I’d ever made.\\nWell, cool!\\nI’ve known for a while now that I wanted to post a good breakfast for the holidays. Originally I was thinking something that could be prepped the night before. I had my eyes set on some kind of casserole, but I just for the life of me could not think up a recipe I was happy with. Something about egg bakes, I always only think of my mom’s waffle strata and since I did something similar last year, that recipe was just not going to work. We always have Monkey Bread on Christmas morning, but for the last few years it seems that after everyone devours the monkey bread, they all run to the stove and start cooking “hearty” food in the form of cheesy eggs, bacon and toast.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "http://www.halfbakedharvest.com/pancetta-wrapped-pork-tenderloin/",
		"p_id": 10004,
		"p_title": "Pancetta Wrapped Pork Tenderloin",
		"p_timestamp": "18/12/2016",
		"p_imageurl": "resources/blogposts/images/bp4.jpg",
		"p_content": "How did we get here? How is it already practically Christmas and how is 2016 almost over? I am honestly just in shock. I have no idea where the year went, but I am excited to be ending it on a high note. My cookbook is just about finished…well, technically I won’t be done until January, but the majority of it will be done. YES! I am also really excited to be spending the holidays with my family. I would not have it any other way. As I’ve mentioned, we have a crowd…plus friends of brothers…all of whom love to eat.\\nOn Friday I was shooting recipes for the cookbook, I think I had about six recipes planned, so I was basically in GO mode all day. But I sent one of the recipes out to everyone who was snowboarding in the backyard (cause ahh if you didn’t know, I have a snowboard park in my backyard…aka Red’s Backyard) and it was devoured in about five minutes flat. The good thing about writing a cookbook and having a large family of brothers with tons of hungry friends is that food gets eaten around here!",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://www.loveandlemons.com/spiralized-daikon-noodle-bowl/",
		"p_id": 10005,
		"p_title": "Spiralized Daikon (Rice Noodle) Bowl",
		"p_timestamp": "15/12/2016",
		"p_imageurl": "resources/blogposts/images/bp5.jpg",
		"p_content": "I’ve made zucchini noodles a whole bunch of times (here and here, to name a few). Zoodles seem to be all the rage, but have you tried “doodles”? Doodles (that’s what I’m calling them) are noodles made out of daikon and they’re awesome. They’ve got a little bit more bite to them than zucchini noodles and I find them to be less watery. I love how they look like rice noodles, yet these noodles are all vegetable.\\nTo go along with the daikon noodles, I made these bowls with cucumber, carrots, radishes, tofu and fresh herbs. These are all bahn mi vegetables, so this is somewhere between a deconstructed bahn mi and a noodle bowl that I get all the time at Elizabeth Street Cafe. With avocado, of course.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://www.loveandlemons.com/chickpea-cauliflower-minestrone-soup/",
		"p_id": 10006,
		"p_title": "Chickpea & Cauliflower Tomato Stew",
		"p_timestamp": "09/12/2016",
		"p_imageurl": "resources/blogposts/images/bp6.jpg",
		"p_content": "We’re en route to snowy Chicago today and I’m trying to think warm thoughts. Yes, I grew up there, but I’m such a baby about winter. Scraping car windows, not being able feel my fingers & toes – I did it for years & it’s just not my thing.\\nBUT I’m excited to spend a little time with my family, eat some good food, and probably cook a little. On the menu, obviously, will be warm food like this hot & hearty vegetable-packed soup.\\nThis is my take on minestrone although it’s a little less than traditional – it’s in between a soup and a stew, and it’s a little heavier on the vegetables and lighter on the noodles. It’s packed with good things like cauliflower, kale (and kale stems!). It’s especially good with the hemp seed & kale pesto I posted yesterday.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://www.loveandlemons.com/spring-broccolini-kale-quinoa-bowls/",
		"p_id": 10007,
		"p_title": "Spring Broccolini & Kale Quinoa Bowls",
		"p_timestamp": "04/12/2016",
		"p_imageurl": "resources/blogposts/images/bp7.jpg",
		"p_content": "When you don’t know what to make for dinner, what do you usually end up making? My go-to is the almighty quinoa bowl. Quinoa bowls are a versatile way to show off the seasons and this one is my little tribute to spring.\\nFor this bowl, I lightly blanched some beautiful broccolini and tossed my quinoa with kale, fresh mint, roasted chickpeas, avocado, and my favorite part – crisp, pink slices of watermelon radish.\\nHere’s a food styling tip for you: seek out watermelon radishes to add some color to your bowl. That pop of pink always look gorgeous and they add a lovely crunch to your salad.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://www.loveandlemons.com/sesame-broccoli-shiitake-noodles/",
		"p_id": 10008,
		"p_title": "Sesame Broccoli and Shiitake Stir Fry ",
		"p_timestamp": "28/11/2016",
		"p_imageurl": "resources/blogposts/images/bp8.jpg",
		"p_content": "Stir fry is probably the first healthy-ish meal I learned to make, although it looked nothing like this. When I was in college, I’d stock up on frozen vegetables because I was broke and they were 4 for $1. Then I’d mix them with instant brown rice and drown it all in soy sauce. It was “healthy” for healthy’s sake and I’d try to convince myself it was delicious while everyone around me ate pizza.\\nSince then, my stir fry game has improved dramatically. Aside from the frozen edamame, the vegetables here are fresh – beautiful baby bok choy, shiitake mushrooms, broccoli, and broccoli STEMS. I use a vegetable peeler to slice thin ribbons off the broccoli stalk and toss them into the pan with everything else. Delicious. College budget or not, it’s so fun to figure out resourceful ways to use every part of a vegetable.\\nAnother thing missing from my college stir fry was a good sauce. This one – made from tamari, ginger, rice vinegar, fresh lime and sesame oil – is light, tangy, and delicious. Make extra if you want to have a quick weeknight stir fry ready to go – the sauce will keep well in the fridge for a few weeks.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://themodernproper.com/posts/classic-creamy-hummus",
		"p_id": 10009,
		"p_title": "Classic Creamy Hummus",
		"p_timestamp": "12/11/2016",
		"p_imageurl": "resources/blogposts/images/bp9.jpg",
		"p_content": "When I was a teenager I had a strict midnight curfew. As an adult I now know that nothing good happens after midnight anyways, but back in my (not so wild) youth I thought what little control over over my social life I had was being completely sabotaged. Luckily for me, my parents were gracious hosts, always willing to let friends (whose parents were a little more laid back than mine) hang out at our house until the wee hours of the morning. Friday nights usually went something like this: school sports game, dinner at a local diner with friends, stand outside of said diner and talk until 11:55pm, and then a hurried call to my mom to let her know I was bringing 10 friends over to watch a movie. As predictable (and lame...I mean tame…) as my weekend and summer nights were, so was my mom’s response. Waiting for my friend’s and I on the coffee table would always be a bag of popped popcorn, a pitcher of lemonade and a lit candle. Completely simple, but oh so sweet.\\nAs teenagers, my sisters and I would tease my mom about her inability to not host regardless of the time or day. It was as if she was compelled. As an adult, I’ve wondered how she had the energy to do it all, and I think I’ve come to a conclusion: I try too hard.\\nIn my head, hosting looks like a pinterest board, a Kinfolk magazine or the myriad of gorgeous table scapes on my Instagram feed. The reality? I have three kids, a house to run, a business, and you know what? I’m just so freaking tired. ALL. THE. TIME. I can't imagine my mom’s reality being any less tiring. Four girls, a demanding schedule, constant visitors, and a church to help run. But, she made it happen. How?",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://themodernproper.com/posts/skillet-chicken-pot-pie",
		"p_id": 10010,
		"p_title": "Skillet Chicken Pot Pie",
		"p_timestamp": "29/10/2016",
		"p_imageurl": "resources/blogposts/images/bp10.jpg",
		"p_content": "Many of you might be wondering why a rich and satisfying pot pie is showing up on our blog as the first post of the new year. I mean, aren’t we all supposed to be denying ourselves right about now? If you've been with us for some time, you may recall that we are big fans of starting each new year off with a slew of healthy recipes, but let's not forget that resolutions aren't all just about health goals. One of mine this year is to find better balance between home/work/life, which these days seems to be a tall order. Maybe you're like me and run a house with busy schedules and several little mouths to feed each night, or maybe (also like me) you're just not quite ready to commit to smoothies for every meal of the day. If you can relate to either of those than you can also relate to the very real need for simple weeknight dinners that everyone can enjoy. And, while this pot pie isn't low carb or Whole 30 approved, it is packed full of chicken and veggies and just might make your life a little simpler.\\nI have a special fondness for pot pies. I loved them as a kid and eating them is the first time I can remember willingly consuming veggies. I could see the veggies (a usual no no in kid land) and yet I didn't care because the pie was just so dang good. Over the years I've tried many recipes and think I've finally settled on my fave right here. This skillet chicken pot pie is easy as...well...pie. It’s a one pot meal that utilizes some pro quick dinner tips and results in a beautiful and homey dish that the whole family can be really excited about.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://themodernproper.com/posts/turkey-pozole-rojo",
		"p_id": 10011,
		"p_title": "Turkey Pozole Rojo",
		"p_timestamp": "25/10/2016",
		"p_imageurl": "resources/blogposts/images/bp11.jpg",
		"p_content": "Once all the amazing holiday meals have been planned, prepared and consumed, the final question remains...“what do I do with all these leftovers?” Don’t get me wrong, I’m all for the warm, traditional flavors that come with roasted turkey, sausage stuffing and maple glazed….everything, but after a week of friends-givings, recipe testing and licking my fingers at preschool potlucks I’m ready for change. So this year I’m saying a big fat NO to turkey sandwiches on dinner rolls and YES to repurposing that bird into a warm bowl of something a little less familiar to most of us: Pozole. Yummmm. \\nThis isn’t just any pozole. For this classic dish I went straight to the source, Windy Veach (also known as Stella or Mama Veach). Wendy is my mother’s friend from her college years, the mother of my brother in law and a true Mexican-American. Many, if not most, of my childhood Thanksgivings were spent in her home, so it seems only fitting that to share her special recipe for this traditional dish to cap off this year’s recipes.",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}, {
		"_p_originalUrl": "https://themodernproper.com/posts/holiday-bread-basket",
		"p_id": 10012,
		"p_title": "Holiday Bread Basket",
		"p_timestamp": "14/10/2016",
		"p_imageurl": "resources/blogposts/images/bp12.jpg",
		"p_content": "In the words of Oprah Winfrey “I love bread.” I'm serious. I lurve it. Like a lot. And you're kidding yourself if you don't agree that there's nothing better than warm, flaky carbs (aka the gateway drug to butter and the cleaning utensil of choice to make sure nothing goes to waste on your Thanksgiving plate). \\nIf you’re in charge of hosting Thanksgiving this year and are overwhelmed with the amount of planning and research that goes into pulling off such an anticipated feast, we’ve got you've covered this season with a variety of sides and mains that we’ll be featuring in the coming weeks . But, if you're not hosting the big day and were given the task of “just bringing the bread”...I'm just going to go out there and say it...chances are someone has little faith in your cooking abilities. Well, jokes on them this year, because I'm about to help you blow them away.\\nHolly and I have searched high and low to find the best (and I really mean the best) breads worthy of of your time in the kitchen and most importantly, your Thanksgiving tables. Here, we're featuring three favorite recipes we've found (authored by some amazing bakers who put serious effort into their development); a flatbread fried in herb oil with herb-whipped feta for dipping, black pepper and nutmeg popovers (holy yum), and seriously the best classic dinner rolls I've ever bitten into (their creator claims to have worked on its recipe for 6 years and you can taste it in every flaky buttery bite).",
		"p_comments": [{
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}, {
			"comment_name": "",
			"comment_timestamp": "",
			"comment_content": ""
		}]
	}]
}
